10/data/attachments/ab8b2b07b9912a79.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_friends_5641f6b7-83e6-4d8a-a818-da2b14bb7ba5</nif:username>
            <nif:friendToBeAdded>David_food_Friend_55985_2</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>